Repository: tedc/castadiva-deploy
Catalog: web/app/plugins/shortcodes-ultimate-maker/lang/sumk-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: Select icon
ru_ru: Выберите иконку

source: Use this image
ru_ru: Использовать изображение

source: Please install and activate latest version of <b>Shortcodes Ultimate</b> to use it's addon <b>Shortcodes Ultimate: Maker</b>.<br />Deactivate this addon to hide message.
ru_ru: Пожалуйста установите и активируйте последнюю версию плагина <b>Shortcodes Ultimate</b> чтобы использовать дополнение <b>Shortcodes Ultimate: Maker</b>.<br />Деактивируйте это дополнение, чтобы скрыть сообщение

source: Install Sortcodes Ultimate
ru_ru: Установить Shortcodes Ultimate

source: Short name (slug)
ru_ru: Короткое имя (slug)

source: Allowed characters: a-z, 0-9, '_' (underscore). Enter attribute name that will be used in resulting shortcode. For example: if you type 'style', you will get next shortcode [shortcode style=""].
ru_ru: Допустимые символы: a-z, 0-9, '_' (подчеркивание). Введите имя атрибута, которое будет использовано в получившемся шорткоде. Например: если вы введете 'style', то в результате получите следующий шорткод [shortcode style=""].

source: Default value
ru_ru: Значение по умолчанию

source: Enter default value for attribute. This value will be used in shortcode if value not specified. Also, this value will be selected by default in shortcode generator.
ru_ru: Введите значение по умолчанию для атрибута. Это значение будет использовано в шорткоде, если при использовании шорткода значение задано не было. А также, это значение будет выделено по умолчанию в генереторе шорткодов.

source: Field type
ru_ru: Тип поля

source: You can use different attribute field types to make use of the shortcode easier. Field types will be used in shortcode generator window (Insert shortcode button at post editing screen).
ru_ru: Вы можете использовать различные типы полей для атрибутов, чтобы сделать использование шорткода более удобным. Типы полей будут использованы в генераторе шорткодов (кнопка Вставка шорткода на странице редактирования записи).

source: Text
ru_ru: Текст

source: Simple text field. Specified default value will be used as plain text in this field.
ru_ru: Простое текстовое поле. Указанное значение по умолчанию будет использовано как простой текст в этом поле

source: Number
ru_ru: Число

source: Integer value. You can specify minimum and maximum values available in this field and step size.
ru_ru: Числовое значение. Вы можете также указать минимальное и максимальное значения, которые могут быть заданы в этом поле. Также можно указать шаг изменения значения.

source: Color
ru_ru: Цвет

source: Color picker. Please set default value with # symbol in beginning. For example: #ffcc00 (yellow), #000 (black).
ru_ru: Пипетка (поле выбора цвета). Пожалуйста используйте символ # (решетка) в начале значения по умолчанию. Примеры: #ffcc00 (желтый), #000 (черный).

source: Dropdown
ru_ru: Выпадающий список

source: Dropdown list. You can enter unlimited options for this list in special field "Dropdown options". Use next format:
ru_ru: Выпадающий список. Вы можете ввести неограниченное кол-во опций для такого списка в специальном поле "Варианты выпадающего списка". Используйте следующий формат:

source: Red color
ru_ru: Красный цвет

source: Blue color
ru_ru: Синий цвет

source: Green color
ru_ru: Зеленый цвет

source: Use option value (not label) to specify default selected value. For example: 'red'
ru_ru: Используйте значение опции (не заголовок), чтобы указать значение по умолчанию. Например: 'red'

source: Switch
ru_ru: Переключатель

source: This field works like a check box. It allows you to select the Yes or No option when creating a shortcode. As a default value, use 'yes' or 'no'.
ru_ru: Это поле работает как флажок. Оно позволяет выбрать вариант Да, либо вариант Нет при создании шорткода. В качестве значения по умолчанию используйте 'yes' либо 'no'.

source: Upload
ru_ru: Загрузка файла

source: This field allows you to upload files from computer and use uploaded file link as value.
ru_ru: Данное поле позволяет загружать файлы с компьтера и использовать ссылку загруженного файла в качестве значения атрибута.

source: HTML mode
ru_ru: Режим HTML

source: In this mode, you can only use HTML code and a specific set of variables. The set of variables depends on the added attributes. For example, if you add the attribute 'color', you can use the variable {{color}} in your code. Independently of added attributes, you can use the variable {{content}}, which will be replaced by the contents of the shortcode (the text between the opening and closing shortcode tags).
ru_ru: В этом режиме вы можете использовать только HTML код и определенный набор переменных. Набор переменных зависит от добавленных атрибутов. Так, например, если вы добавите атрибут с коротким именем color, то сможете использовать в коде переменную {{color}}. Независимо от добавленных атрибутов, вы можете использовать переменную {{content}}, которая будет заменена на содержимое шорткода (текст между открывающим и закрывающим тегами шорткода).

source: Example code
ru_ru: Пример кода

source: This mode is a bit complicated than the previous. Using this mode, you need to write code in PHP. The output of the code must be returned, but not displayed. To do this, use 'return' operator. In this mode you can not use functions such as print_r, echo or die. If you do not understand the difference between the return and echo in PHP, then better to use the HTML mode or PHP echo.
ru_ru: Этот режим немного сложнее предыдущего. Используя этот режим, нужно писать код на PHP. Результат выполнения кода должен быть возвращен, а не выведен. Чтобы сделать это, используйте оператор 'return' . В этом режиме вы не можете использовать такие функции, как print_r, echo или die. Если вы не понимаете разницы между операторами return и echo в PHP, то лучше использовать режим HTML или PHP echo.

source: All added attributes are available as variables. For example, if you add an attribute with short name 'color', then the code can use a variable named $color. Variable $content will contain actual shortcode content (the text between the opening and closing shortcode tags).
ru_ru: Все добавленные атрибуты будут доступны в коде в виде переменных. Например, если вы добавите атрибут с коротким именем 'color', то в коде можно будет использовать переменную $color. Переменная $content будет содержать контент шорткода (текст между открывающим и закрывающим тегами шорткода).

source: This mode is similar to the previous (PHP return). However, in this mode you can use any of the functions and operators that display text. It is recommended to use the echo statement to output the code. All attributes are available as variables.
ru_ru: Этот режим аналогичен предыдущему (PHP return). Но в данном режиме вы можете использовать любые функции и операторы, которые выводят текст. Рекомендуется использовать оператор echo для вывода кода. Все аттрибуты также доступны в виде переменных.

source: Icon
ru_ru: Иконка

source: Media library
ru_ru: Медаи библиотека

source: Image source
ru_ru: Источник изображений

source: Customer support
ru_ru: Поддержка покупателей

source: Demo shortcode #1: HTML code example
ru_ru: Демо шорткод #1: пример HTML кода

source: This shortcode written with simple HTML and allows you to change the color of selected text
ru_ru: Этот шорткод написан с использованием простого HTML кода и позволяет вам изменять цвет выделенного текста

source: Default content
ru_ru: Содержимое по умолчанию

source: Text color
ru_ru: Цвет текста

source: Color of selected text
ru_ru: Цвет выделенного текста

source: Demo shortcode #2: PHP return code example
ru_ru: Демо шорткод #2: пример кода PHP return

source: This shortcode does the same thing as a shortcode #1 but written in PHP and uses PHP return mode
ru_ru: Этот шорткод делает тоже самое что и шорткод #1, но написан на PHP и использует режим кода PHP return

source: Demo shortcode #3: PHP echo code example
ru_ru: Демо шорткод #3: пример кода PHP echo

source: This shortcode is more complex than shortcodes #1 and #2. This example will show you how to use PHP echo mode, as well as how to use several different types of attributes
ru_ru: Этот шорткод более сложный чем шорткоды #1 и #2. Данный пример покажет вам как использовать режим кода PHP echo, а также как использовать различные типы атрибутов

source: Style
ru_ru: Стиль

source: Select box style
ru_ru: Выберите стиль блока

source: Info
ru_ru: Информация

source: Error
ru_ru: Ошибка

source: Success
ru_ru: Успех

source: Size
ru_ru: Размер

source: Choose box size
ru_ru: Укажите размер блока

source: 3 demo shortcodes added to the database
ru_ru: 3 демо-шорткода добавлены в базу данных

source: View
ru_ru: Посмотреть

source: Shortcode details
ru_ru: Параметры шорткода

source: Please fill all required fields. They marked with red asterisk.
ru_ru: Пожалуйста заполните все обязательные поля. Они отмечены красной звездочкой.

source: Shortcode name
ru_ru: Имя шорткода

source: Enter shortcode name (1-2 words)
ru_ru: Введите имя шорткода (1-2 слова)

source: Allowed characters: a-z, 0-9, '_' (underscore)
ru_ru: Допустимые символы: a-z, 0-9, '_' (подчркивание)

source: Specify short name for this shortcode. This name will be used for resulting shortcode. For example: type 'div' and you will get shortcode [div]
ru_ru: Введите короткое имя шорткода. Это имя будет использовано для создания самого шорткода. Например: введите 'div' и получите шорткод [div]

source: Shortcode description
ru_ru: Описание шорткода

source: Enter short description for this shortcode. 3-7 words is more than enough
ru_ru: Введите описание для этого шорткода. 3-7 слов более чем достаточно

source: This text will be added to Content field in shortcode generator. This field is not required and used not by all shortcodes. Content of this field will be placed between open and close shortcode tags by default
ru_ru: Этот текст будет размещен в поле Содержимое в генераторе шорткодов. Это не обязательное поле и используется не всеми шорткодами. Содержимое этого поля будет по умолчанию размещено между открывающим и закрывающим тегами шорткода

source: Change icon
ru_ru: Сменить иконку

source: You can change shortcode icon. This icon will be used in shortcode generator window
ru_ru: Вы можете изменить иконку этого шорткода. Она будет использована в окне генератора шорткодов

source: Attributes
ru_ru: Атрибуты

source: Open attributes documentation
ru_ru: Открыть документацию по атрибутам

source: Add attribute
ru_ru: Добавить атрибут

source: Drag and drop attributes to re-order
ru_ru: Перетащите атрибуты, чтобы изменить их порядок

source: Code
ru_ru: Код

source: Open code editor documentation
ru_ru: Открыть документацию по редактору кода

source: You can use next variables
ru_ru: Вы можете использовать следующие переменные

source: click to insert variable
ru_ru: Нажмите чтобы вставить переменную

source: They will be replaced with shortcode content and attributes values
ru_ru: Они будут заменены на содержимое шорткода и на значения атрибутов

source: Update shortcode
ru_ru: Обновить шорткод

source: Save draft
ru_ru: Сохранить черновик

source: Publish
ru_ru: Опубликовать

source: Delete
ru_ru: Удалить

source: Edit
ru_ru: Изменить

source: Close
ru_ru: Закрыть

source: Attribute name
ru_ru: Имя атрибута

source: Attribute description
ru_ru: Описание атрибута

source: Dropdown options
ru_ru: Варианты выпадающего списка

source: Minimal value
ru_ru: Минимальное значение

source: Maximal value
ru_ru: Максимальное значение

source: Step number
ru_ru: Шаг

source: Add full name and description
ru_ru: Добавить полное имя и описание

source: not required but recommended
ru_ru: не обязательно, но рекомендуется

source: Custom shortcodes
ru_ru: Пользовательские шорткоды

source: Shortcode
ru_ru: Шорткод

source: Create shortcode
ru_ru: Создать шорткод

source: Add new Shortcode
ru_ru: Добавить новый шорткод

source: Edit shortcode
ru_ru: Редактировать шорткод

source: New shortcode
ru_ru: Новый шорткод

source: View shortcode
ru_ru: Просмотр шорткода

source: Search shortcodes
ru_ru: Поиск шорткодов

source: No shortcodes found
ru_ru: Шорткоды не найдены

source: No shortcodes in Trash
ru_ru: В корзине нет шорткодов

source: Shortcodes
ru_ru: Шорткоды

source: Shortcode updated
ru_ru: Шорткод обновлен

source: Shortcode added
ru_ru: Шорткод добавлен

source: Shortcode saved
ru_ru: Шорткод сохранен

source: Shortcode submitted
ru_ru: Шорткод отправлен

source: Shortcode draft updated
ru_ru: Черновик шорткода обновлен

source: Custom
ru_ru: Пользовательские

source: Shortcodes Ultimate: Maker addon
ru_ru: Пользовательские шорткоды

source: Vladimir Anokhin
ru_ru: Владимир Анохин

source: Shortcodes Ultimate add-on. Provides UI for creating custom shortcodes
ru_ru: Дополнение для плагина Shortcodes Ultimate. Позволяет создавать пользовательские шорткоды
